PKS1C/src/Documents/ДневнойОтчетПочасовыхРабот/ДневнойОтчетПочасовыхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДневнойОтчетПочасовыхРабот</name>
  <registerRecords>InformationRegister.ПочасовыеРаботы</registerRecords>
  <registerRecords>InformationRegister.РаботыПоЗаявкам</registerRecords>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаленка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сверхурочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкиКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PKS1C/src/Documents/ДневнойОтчетПочасовыхРабот/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДневнойОтчетПочасовыхРабот.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДневнойОтчетПочасовыхРабот.Дата,
	|	ДневнойОтчетПочасовыхРабот.Исполнитель,
	|	ДневнойОтчетПочасовыхРабот.Номер,
	|	ДневнойОтчетПочасовыхРабот.Данные.(
	|		НомерСтроки,
	|		ВремяПрибытия,
	|		ВремяЗавершения,
	|		Клиент,
	|		СоставРабот,
	|		Удаленка,
	|		Сверхурочка
	|	)
	|ИЗ
	|	Документ.ДневнойОтчетПочасовыхРабот КАК ДневнойОтчетПочасовыхРабот
	|ГДЕ
	|	ДневнойОтчетПочасовыхРабот.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанныеШапка = Макет.ПолучитьОбласть("РаботыШапка");
	ОбластьДанные = Макет.ПолучитьОбласть("Работы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДанныеШапка);
		ВыборкаДанные = Выборка.Данные.Выбрать();
		Пока ВыборкаДанные.Следующий() Цикл
			ОбластьДанные.Параметры.Заполнить(ВыборкаДанные);
			ОбластьДанные.Параметры.ОбъемРабот = ПолучитьОбъемРаботы(ОбластьДанные.Параметры.ВремяПрибытия,
																	 ОбластьДанные.Параметры.ВремяЗавершения,
																	 ОбластьДанные.Параметры.Удаленка);
			ТабДок.Вывести(ОбластьДанные, ВыборкаДанные.Уровень());
			Если ОбластьДанные.Параметры.Сверхурочка Тогда
				ТабДок.Область("СверхурочкаЯчейка").ЦветФона = WebЦвета.СветлоСерый;
			КонецЕсли;															
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
